output/posts/cython/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>cython | chimez's blog</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/ipython.min.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/nikola_ipython.css" rel="stylesheet" type="text/css">
<link href="https://fonts.googleapis.com/css?family=Playfair+Display:700,900" rel="stylesheet">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" hreflang="en" href="../../rss.xml">
<link rel="canonical" href="https://chimez.github.io/posts/cython/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="chimez">
<link rel="prev" href="../mpi/" title="MPI" type="text/html">
<link rel="next" href="../klib/" title="klib" type="text/html">
<meta property="og:site_name" content="chimez's blog">
<meta property="og:title" content="cython">
<meta property="og:url" content="https://chimez.github.io/posts/cython/">
<meta property="og:description" content="Cython



基本概念



文件


.pyx 是 cython 语法的源文件
.pyd (windows) 是 windows 平台上编译后的文件，对应 linux 平台的 *.so
.pyd (源文件) 是外部声明，即对 .h 头文件的重新封装





库


Cython.Build python 端调用，用于编译
cython.parallel cython 端调用，并行 pra">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2021-08-05T20:47:25+08:00">
<meta property="article:tag" content="cython">
<meta property="article:tag" content="python">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Header and menu bar -->
<div class="container">
      <header class="blog-header py-3"><div class="row nbb-header align-items-center">
          <div class="col-md-3 col-xs-2 col-sm-2" style="width: auto;">
            <button class="navbar-toggler navbar-light bg-light nbb-navbar-toggler" type="button" data-toggle="collapse" data-target=".bs-nav-collapsible" aria-controls="bs-navbar" aria-expanded="false" aria-label="Toggle navigation">
                <span class="navbar-toggler-icon"></span>
            </button>
            <div class="collapse bs-nav-collapsible bootblog4-search-form-holder">
                
            </div>
        </div>
          <div class="col-md-6 col-xs-10 col-sm-10 bootblog4-brand" style="width: auto;">
            <a class="navbar-brand blog-header-logo text-dark" href="../../">

            <span id="blog-title">chimez's blog</span>
        </a>
          </div>
            <div class="col-md-3 justify-content-end align-items-center bs-nav-collapsible collapse flex-collapse bootblog4-right-nav">
            <nav class="navbar navbar-light bg-white"><ul class="navbar-nav bootblog4-right-nav">
<li class="nav-item">
    <a href="index.org" id="sourcelink" class="nav-link">Source</a>
    </li>


                    
            </ul></nav>
</div>
    </div>
</header><nav class="navbar navbar-expand-md navbar-light bg-white static-top"><div class="collapse navbar-collapse bs-nav-collapsible" id="bs-navbar">
            <ul class="navbar-nav nav-fill d-flex w-100">
<li class="nav-item">
<a href="../../archive.html" class="nav-link">Archive</a>
                </li>
<li class="nav-item">
<a href="../../categories/" class="nav-link">Tags</a>
                </li>
<li class="nav-item">
<a href="../../rss.xml" class="nav-link">RSS feed</a>

                
            </li>
</ul>
</div>
<!-- /.navbar-collapse -->
</nav>
</div>

<div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        
        
        
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">cython</a></h1>

        <div class="metadata">
            <p class="byline author vcard p-author h-card"><span class="byline-name fn p-name" itemprop="author">
                    chimez
            </span></p>
            <p class="dateline">
            <a href="." rel="bookmark">
            <time class="published dt-published" datetime="2021-08-05T20:47:25+08:00" itemprop="datePublished" title="2021-08-05 20:47">2021-08-05 20:47</time></a>
            </p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-orgc0403b5" class="outline-2">
<h2 id="orgc0403b5">Cython</h2>
<div class="outline-text-2" id="text-orgc0403b5">
</div>
<div id="outline-container-orgacd7a20" class="outline-3">
<h3 id="orgacd7a20">基本概念</h3>
<div class="outline-text-3" id="text-orgacd7a20">
</div>
<div id="outline-container-org5c85d88" class="outline-4">
<h4 id="org5c85d88">文件</h4>
<div class="outline-text-4" id="text-org5c85d88">
<ol class="org-ol">
<li>
<code>.pyx</code> 是 <code>cython</code> 语法的源文件</li>
<li>
<code>.pyd</code> (windows) 是 windows 平台上编译后的文件，对应 linux 平台的 <code>*.so</code>
</li>
<li>
<code>.pyd</code> (源文件) 是外部声明，即对 <code>.h</code> 头文件的重新封装</li>
</ol>
</div>
</div>

<div id="outline-container-orgba1426d" class="outline-4">
<h4 id="orgba1426d">库</h4>
<div class="outline-text-4" id="text-orgba1426d">
<ol class="org-ol">
<li>
<code>Cython.Build</code> python 端调用，用于编译</li>
<li>
<code>cython.parallel</code> cython 端调用，并行 <code>prange</code>
</li>
</ol>
<p>
所有 c 库在 <a href="https://github.com/cython/cython/tree/master/Cython/Includes">Cython/Includes</a> 中
</p>
<ol class="org-ol">
<li>
<code>libc</code> cython 端调用， c 标准库</li>
<li>
<code>libcpp</code> cython 端调用， c++ stl 库</li>
<li>
<code>numpy</code> cython 端调用，numpy 支持</li>
<li>
<code>posix</code> cython 端调用，posix 库</li>
<li>
<code>openmp</code> cython 端调用，并行</li>
<li>
<code>cpython</code> cython 端调用， python 的 c 接口</li>
<li>
<code>cython</code> cython 端调用，控制特殊行为</li>
</ol>
</div>
</div>

<div id="outline-container-orgc494f55" class="outline-4">
<h4 id="orgc494f55">语法</h4>
<div class="outline-text-4" id="text-orgc494f55">
<div class="highlight"><pre><span></span>    from libc.math cimport log2 # 引入 c 函数
    cdef int x # 声明变量类型
    cdef int [:,:] x # 声明变量是 numpy 的 2d 向量
    ctypedef struct queue: # 声明类型
	pass

    ctypedef fused my_type: # 泛型
	int
	double
	long long

    # 类的定义，注意使用 __cinit__
    cdef class A:
	cdef int a
	def __cinit__(self):
	    self.a = 1

    &lt;void*&gt;value # 类型转换成指针

    # 定义 c 函数，异常时返回 -1
    cdef int func(int x) execpt? -1:
	pass
</pre></div>
</div>
</div>

<div id="outline-container-orga831683" class="outline-4">
<h4 id="orga831683">文件注解</h4>
<div class="outline-text-4" id="text-orga831683">
<ol class="org-ol">
<li>
<code># distutils: language=c++</code> 使用 <code>c++</code> 编译</li>
<li>
<code># distutils: sources = c-algorithms/src/queue.c</code> 指定静态链接的源文件</li>
<li>
<code># distutils: include_dirs = c-algorithms/src/</code> 指定头文件目录</li>
<li>
<code># distutils: extra_compile_args=-fopenmp</code> 指定编译器参数</li>
<li>
<code># distutils: extra_link_args=-fopenmp</code> 指定链接参数</li>
<li>
<code># cython: infer_types=True</code> 自动推断类型，只作用于一级缩进的变量</li>
<li>
<code># cython: profile=True</code> 开启 profile</li>
<li>
<code># cython: linetrace=True</code> 开启 profile 行追踪</li>
</ol>
</div>
</div>

<div id="outline-container-org2b6c83b" class="outline-4">
<h4 id="org2b6c83b">函数注解</h4>
<div class="outline-text-4" id="text-org2b6c83b">
<ol class="org-ol">
<li>
<code>@cython.boundscheck(False)</code> 关闭数组边界检查</li>
<li>
<code>@cython.wraparound(False)</code> 关闭负指标</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org1a5bfd2" class="outline-3">
<h3 id="org1a5bfd2">编译</h3>
<div class="outline-text-3" id="text-org1a5bfd2">
</div>
<div id="outline-container-org68dffdf" class="outline-4">
<h4 id="org68dffdf">基本结构</h4>
<div class="outline-text-4" id="text-org68dffdf">
<p>
<code>setup.py</code>
</p>
<div class="highlight"><pre><span></span>    <span class="kn">from</span> <span class="nn">setuptools</span> <span class="kn">import</span> <span class="n">setup</span>
    <span class="kn">from</span> <span class="nn">Cython.Build</span> <span class="kn">import</span> <span class="n">cythonize</span>

    <span class="n">setup</span><span class="p">(</span>
	<span class="n">ext_modules</span> <span class="o">=</span> <span class="n">cythonize</span><span class="p">(</span><span class="s2">"helloworld.pyx"</span><span class="p">)</span>
    <span class="p">)</span>
</pre></div>

<p>
<code>helloworld.pyx</code>
</p>
<div class="highlight"><pre><span></span>    <span class="nb">print</span><span class="p">(</span><span class="s2">"Hello World"</span><span class="p">)</span>
</pre></div>

<p>
执行命令
</p>
<div class="highlight"><pre><span></span>    python setup.py build_ext --inplace
</pre></div>

<p>
这编译得到的 <code>helloworld.so</code> 或 <code>helloworld.pyd</code>
</p>
</div>
</div>

<div id="outline-container-org946002f" class="outline-4">
<h4 id="org946002f">动态链接</h4>
<div class="outline-text-4" id="text-org946002f">
<p>
<a href="https://cython.readthedocs.io/en/latest/src/tutorial/external.html#dynamic-linking">参考</a>
</p>

<p>
需要指明 <code>libraries</code> 参数
</p>
<div class="highlight"><pre><span></span>    <span class="kn">from</span> <span class="nn">setuptools</span> <span class="kn">import</span> <span class="n">Extension</span><span class="p">,</span> <span class="n">setup</span>
    <span class="kn">from</span> <span class="nn">Cython.Build</span> <span class="kn">import</span> <span class="n">cythonize</span>

    <span class="n">ext_modules</span> <span class="o">=</span> <span class="p">[</span>
	<span class="n">Extension</span><span class="p">(</span><span class="s2">"demo"</span><span class="p">,</span>
		  <span class="n">sources</span><span class="o">=</span><span class="p">[</span><span class="s2">"demo.pyx"</span><span class="p">],</span>
		  <span class="n">libraries</span><span class="o">=</span><span class="p">[</span><span class="s2">"m"</span><span class="p">]</span>  <span class="c1"># Unix-like specific</span>
		  <span class="p">)</span>
    <span class="p">]</span>

    <span class="n">setup</span><span class="p">(</span><span class="n">name</span><span class="o">=</span><span class="s2">"Demos"</span><span class="p">,</span>
	  <span class="n">ext_modules</span><span class="o">=</span><span class="n">cythonize</span><span class="p">(</span><span class="n">ext_modules</span><span class="p">))</span>
</pre></div>
</div>
</div>

<div id="outline-container-org6f66bc9" class="outline-4">
<h4 id="org6f66bc9">静态链接</h4>
<div class="outline-text-4" id="text-org6f66bc9">
<p>
使用注解 
</p>
<div class="highlight"><pre><span></span>    # distutils: sources = c-algorithms/src/queue.c
    # distutils: include_dirs = c-algorithms/src/

    pass
</pre></div>
</div>
</div>
</div>

<div id="outline-container-org4634e9b" class="outline-3">
<h3 id="org4634e9b">使用 c 库</h3>
<div class="outline-text-3" id="text-org4634e9b">
</div>
<div id="outline-container-org41fd3ff" class="outline-4">
<h4 id="org41fd3ff">外部声明</h4>
<div class="outline-text-4" id="text-org41fd3ff">
<p>
使用头文件, 外部声明可以放在 <code>.pyd</code> 文件中
</p>
<div class="highlight"><pre><span></span>    cdef extern from "math.h":
	double sin(double x)
</pre></div>
</div>
</div>

<div id="outline-container-orgcff95c2" class="outline-4">
<h4 id="orgcff95c2">异常处理</h4>
<div class="outline-text-4" id="text-orgcff95c2">
<ol class="org-ol">
<li>
<code>except? -1</code> 语法表示当发生任何错误时，返回 <code>-1</code>
</li>
<li>
<code>execpt *</code> 表示返回时调用 <code>PyErr_Occurred()</code> ，当函数返回 <code>void</code> 并且需要传递错误时使用这个</li>
</ol>
<div class="highlight"><pre><span></span>    cdef int pop(self) except? -1:
	if cqueue.queue_is_empty(self._c_queue):
	    raise IndexError("Queue is empty")
	return &lt;Py_ssize_t&gt;cqueue.queue_pop_head(self._c_queue)

    cdef int spam() except *:
	...
</pre></div>
</div>
</div>
</div>

<div id="outline-container-org659996e" class="outline-3">
<h3 id="org659996e">使用 numpy</h3>
<div class="outline-text-3" id="text-org659996e">
<p>
numpy 的 <code>ndarray</code> 在 cython 中用做 typed memoryview
</p>
</div>

<div id="outline-container-orgf9b5372" class="outline-4">
<h4 id="orgf9b5372">基本例子</h4>
<div class="outline-text-4" id="text-orgf9b5372">
<div class="highlight"><pre><span></span>    import numpy as np

    DTYPE = np.intc


    cdef int clip(int a, int min_value, int max_value):
	return min(max(a, min_value), max_value)


    def compute(int[:, :] array_1, int[:, :] array_2, int a, int b, int c):

	cdef Py_ssize_t x_max = array_1.shape[0]
	cdef Py_ssize_t y_max = array_1.shape[1]
	assert tuple(array_1.shape) == tuple(array_2.shape)

	result = np.zeros((x_max, y_max), dtype=DTYPE)
	cdef int[:, :] result_view = result

	cdef int tmp
	cdef Py_ssize_t x, y

	for x in range(x_max):
	    for y in range(y_max):

		tmp = clip(array_1[x, y], 2, 10)
		tmp = tmp * a + array_2[x, y] * b
		result_view[x, y] = tmp + c

	return result
</pre></div>
</div>
</div>
</div>

<div id="outline-container-orgc2a71a3" class="outline-3">
<h3 id="orgc2a71a3">并行</h3>
<div class="outline-text-3" id="text-orgc2a71a3">
<ol class="org-ol">
<li>使用 <code>prange</code>
</li>
<li>
<p>
使用 <code>nogil</code>
</p>

<div class="highlight"><pre><span></span>      from cython.parallel import prange
      cdef int func(int x) nogil:
	  cdef int i
	  cdef int y
	  for i in prange(x, nogil=True):
	      y += i 
	  return y
</pre></div>
</li>
</ol>
</div>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../categories/cython/" rel="tag">cython</a></li>
            <li><a class="tag p-category" href="../../categories/python/" rel="tag">python</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../mpi/" rel="prev" title="MPI">Previous post</a>
            </li>
            <li class="next">
                <a href="../klib/" rel="next" title="klib">Next post</a>
            </li>
        </ul></nav></aside></article><!--End of body content--><footer id="footer">
            Contents © 2021         <a href="mailto:chimez@163.com">chimez</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
            
        </footer>
</div>
</div>


        <script src="../../assets/js/all-nocdn.js"></script><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element){var i=element.getElementsByTagName('img')[0];return i===undefined?'':i.alt;}});
    </script>
</body>
</html>
